// constants.js
const importantItemsList = [
    "شطه حلوة", "شطة حدة", "بابريكا مدخنة", "فلفل اسود ناعم", "كزبرة ناعمة", "كزبرة حب", "قرفة خشنة عيدان", "قرفة سيجار",
    "كمون ناعم", "كمون حب", "كاكاو نخب اول", "كاكاو نخب ثاني", "كركم", "كريمة محلاية", "كبسة ناعمة", "كبسة خليجية",
    "كاري", "مندي", "زنجبيل خشن", "زنجبيل ناعم", "سمسم", "سماق ناعم", "شيش", "شاورما", "حبة البركة", "ثوم ناعم",
    "بصل ناعم", "ملح ليمون", "ملح صيني", "ماجي صفراء", "ماجي بيضاء", "مشكلة", "مشكلة بيضاء", "نشا مصري", "هيل ناعم", "هيل حب"
];

const spicesExtraItemsList = [
    "عصفر", "توابل هندية حارة", "صفار الزعفران", "صفار البيض", "فلفل اسود حب", "فلفل ابيض ناعم", "فلافل", "فاهيتا",
    "قرنفل ناعم", "قرنفل حب", "قرفة ناعمة", "قلي", "كتشب", "كراوية", "كريسبي", "بطاطا", "بروستد", "زعتر اوريجانو",
    "بيتزا", "جوزة الطيب ناعمة", "جوزة الطيب حب", "حلبة حب", "حلبة ناعمة", "خل نكهة", "خميرة", "لحمة خاروف", "مكسيكي",
    "مشاوي", "مدخنة", "محاشي", "نشا درس", "يانسون ناعم", "سدر ناعم", "سمك", "سجق", "سحلب", "شبة ناعمة", "نوديلز اندومي"
];

const extraItemsList = [
    "بذر دوار شمس ملكي", "بذر دوار شمس الشبح", "بذر اصفر ملكي", "بذر اسود ملكي", "بذر كوسا", "بذر ابيض عريض",
    "فستق مدخن", "فستق مملح", "ذرة الفوشار", "شوفان", "نعنع يابس", "نسكافية خشنة", "اشلميش","لوز ني","كاجو ني","لوز بقشرو", "فستق ني",
    "لبان الدكر", "لومي", "لومي اسود", "كركدية", "زهرة الالماسة", "شمرا ناعمة", "شمرا حب", "زهورات مشكلة",
    "جوز امريكي", "تمر سري", "جوز هند خشن", "جوز هند ناعم", "بذور الشيا", "بذور الكتان", "بذور الرشاد", "رمان زركش"
];

const bagTypesList = ["شفاف 10×12","شفاف 20×12","شفاف 10×20","شفاف 25×17","شفاف 20×30","شفاف 35×25","صيدلية","أسود 30","أسود 35","أسود 40","أسود 45"];

function getImportantItems() { return importantItemsList.map(name => ({ name, type: "range", min: 1, max: 5, step: 1 })); }
function getExtraItems() { return extraItemsList.map(name => ({ name, type: "range", min: 1, max: 10, step: 1 })); }
function getSpicesExtraItems() { return spicesExtraItemsList.map(name => ({ name, type: "range", min: 1, max: 10, step: 1 })); }
